testCase/oversetEx_pimpleDymFoam/0.org/nut
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  plus                                  |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      nut;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [ 0 2 -1 0 0 0 0 ];

internalField   uniform 0;

boundaryField
{
        

    ballIn
    {
        type            zeroGradient;
    }

    ballOut
    {
        type            overset;
    }

	inlet
    {
        type            zeroGradient;
    }

	outlet
    {
        type            zeroGradient;
    }

	sides
    {
        type            zeroGradient;
    }


	frontAndBack
	{
		type empty;	
	}


}

// ************************************************************************* //
