testCase/oversetEx_pimpleDymFoam/constant/dynamicMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1806                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      dynamicMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dynamicFvMesh       oversetAndAMRFvMesh; //banana; //dynamicOversetFvMesh;


motionSolverLibs ("libsixDoFRigidBodyMotion.so");

dynamicOversetFvMeshCoeffs
{
//    layerRelax 0.3;
}


solver   sixDoFRigidBodyMotion;


sixDoFRigidBodyMotionCoeffs
 {
     patches         (ballIn);
     innerDistance   0.03;
     outerDistance   0.05;
     centreOfMass    (0 0 0 );
     mass            0.155;
     momentOfInertia ( 7.6e-5 7.6e-5 7.6e-5);
     velocity        ( 30 0 0 );
     rhoName         rhoInf;
	 rho             rhoInf;
     rhoInf          1.0;
     accelerationRelaxation 0.9;
     accelerationDamping 0.95;
     report          on;
     reportToFile    on;
     solver
     {
         type            CrankNicolson;
     }
     constraints
     {
         twoDmotionOnly
        {
            sixDoFRigidBodyMotionConstraint   plane;
            normal                            (0 0 1);
    	}

		 noRotation
		 {
   		sixDoFRigidBodyMotionConstraint   axis;
   		axis                              (0 0 1);
		 }


     }
     restraints
     {
     }
 }


/*--Begin: adaptive mesh refinement parameters-------*/
//-----------------------------------------------------
// How often to refine
refineInterval  1;

// Field to be refinement on
field           p;// alpha.water;

// Refine field inbetween lower..upper
lowerRefineLevel 0.001;
upperRefineLevel 0.999;

// If value < unrefineLevel unrefine
unrefineLevel   10;

// Have slower than 2:1 refinement
nBufferLayers   1;

// Refine cells only up to maxRefinement levels
maxRefinement   2;

// Stop refinement if maxCells reached
maxCells        1500000;

// Flux field and corresponding velocity field. Fluxes on changed
// faces get recalculated by interpolating the velocity. Use 'none'
// on surfaceScalarFields that do not need to be reinterpolated.
correctFluxes
(
    (phi none)
    (nHatf none)
    (rhoPhi none)
    (alphaPhi none)
    (ghf none)
    (phi0 none)
    (dVf_ none)
);

// Write the refinement level as a volScalarField
dumpLevel       true;

//-----------------------------------------------------
/*--End: adaptive mesh refinement parameters --*/






// ************************************************************************* //
